app/views/tracks/show.html.erb

</p>
<% if @track.notes.count > 0 %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 44]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 44]]