app/controllers/albums_controller.rb

  def new
    @album = Album.new(band: Band.find(params[:band_id]))
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 6], ["title", "News of the World"], ["year", 1977], ["studio", false], ["created_at", "2018-09-13 21:16:03.693696"], ["updated_at", "2018-09-13 21:16:03.693696"]]

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Midnight Memoriess"], ["updated_at", "2018-09-13 22:18:36.661915"], ["id", 92]]