app/controllers/bands_controller.rb

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 15]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def destroy
    Band.find(params[:id]).destroy