app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @track = Track.find(params[:id])
    if @track.update(track_params)
---
UPDATE "tracks" SET "ord" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["ord", 3], ["updated_at", "2018-09-14 00:03:16.415891"], ["id", 491]]

  def destroy
    @track = Track.find(params[:id])
    @track.destroy
---
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 502]]